// Написать программу, которая через prompt считывает число и выводит в консоль число равное 10% от введенного числа
// const num =  prompt("Введите число")
// console.log(num * 0.10);


// Написать программу, которая получает два числа и выводит наименьшее.
// const num1 = prompt("Введите первое число")
// const num2 = prompt("Введите второе число")
//  if (num1 > num2) {
//     console.log(num2);
//  }
//  else { 
//  console.log(num1);}


// Написать программу, которая считывает через prompt число и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’
// const num3 = prompt("Введите число")
//  if(num3 < 100) {
//     console.log("Число меньше 100");
//  } else if (num3 > 100) {
//     console.log("Число больше 100");
//  } else if (num3 == 100) {
//     console.log("Число равно 100");
//  }

// Написать программу, которая запрашивает у пользователя его имя и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, если пользователь совершеннолетний,
// или ‘Hi, <name>’, если пользователь несовершеннолетний.
// const name = prompt("Введите ваше имя")
// const age = prompt("Введите ваш возраст")
//  if (age < 18) {
//     console.log(`Hi, ${name}`);
//  } else if (age > 18) {
//     console.log(`Hello, ${name}`);
//  }













































